In [6]:
import pandas as pd

s1 = pd.Series({
    "김": 100,
    "나": 141,
    "박": 129,
    "이": 123
})
s1.name = "수학"
print(s1)

s2 = pd.Series({
    "김": 30,
    "나": 11,
    "박": 29,
    "이": 133
})
print(s2)

s3 = pd.Series([0, 20, 3, 5])
s3.name = "국어"
print(s3)

s4 = pd.Series([30, 50, 30, 31])
print(s4)

김    100
나    141
박    129
이    123
Name: 수학, dtype: int64
김     30
나     11
박     29
이    133
dtype: int64
0     0
1    20
2     3
3     5
Name: 국어, dtype: int64
0    30
1    50
2    30
3    31
dtype: int64

In [8]:
df = pd.DataFrame({
    "출생지": ["한국","미국"],
    "나이": [20, 30]
})

df

  출생지  나이
0  한국  20
1  미국  30

In [9]:
df["성별"] = ["여", "남"]
df

  출생지  나이 성별
0  한국  20  여
1  미국  30  남

In [10]:
df.loc[2] = ["일본", 25, "여"]
df

  출생지  나이 성별
0  한국  20  여
1  미국  30  남
2  일본  25  여

In [12]:
df2 = pd.DataFrame(s1)
df2["영어"] = s2
df2["미술"] = [1, 2, 3, 4]
df2

    수학   영어  미술
김  100   30   1
나  141   11   2
박  129   29   3
이  123  133   4

In [13]:
df2[["수학", "미술"]]

    수학  미술
김  100   1
나  141   2
박  129   3
이  123   4

In [14]:
df2.loc[["김", "박"]]

    수학  영어  미술
김  100  30   1
박  129  29   3

In [15]:
df2.loc[["김"],["미술","영어"]]

   미술  영어
김   1  30

In [17]:
df2.sum()

수학    493
영어    203
미술     10
dtype: int64

In [20]:
df2.mean(axis=1)

김    43.666667
나    51.333333
박    53.666667
이    86.666667
dtype: float64

In [21]:
df2["수학"].mean()

123.25

In [22]:
df2.loc[df2["영어"] >= 100, "수학"]

이    123
Name: 수학, dtype: int64

In [23]:
df2["수학"].var()

296.25

In [24]:
df2["수학"].std()

17.211914478058507